Revit 2024 API
BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotOnlyLines Property
 The Floor or Roof or Toposolid may only contain straight lines.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlabShapeFailedNotOnlyLines { get; }
Visual Basic
Public Shared ReadOnly Property SlabShapeFailedNotOnlyLines As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlabShapeFailedNotOnlyLines {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace